app/Controllers/HomeController.php

SELECT *
FROM `film`
SELECT *
FROM `artiste`
---
    public function index()
    {
        // Instanciation des modèles de films et d'artistes
        $filmModel = new FilmModel();
        $artisteModel = new ArtisteModel();

        // Récupération de tous les films et artistes
        $data['films'] = $filmModel->findAll();
        $data['artistes'] = $artisteModel->findAll();