app/Controllers/ProduitController.php

SELECT *
FROM `produit`
---
    public function listproduit()
    {
        $produitModel = new ProduitModel();
        $produits = $produitModel->findAll();

INSERT INTO `produit` (`nom_produit`, `prix`) VALUES ('meziane', '123')
---
    public function insertProduit()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'nom' => 'required',
            'prix' => 'required|numeric'
        ]);

        if ($validation->withRequest($this->request)->run()) {
            $produitModel = new ProduitModel();

            $newProduit = [
                'nom_produit' => $this->request->getPost('nom'),
                'prix' => $this->request->getPost('prix'),
            ];

            $produitModel->insert($newProduit);

UPDATE `produit` SET `nom_produit` = 'Lecteur blu-Ray 4K Samsungssdzs', `prix` = '111111111111111111111111111111111111111'
WHERE `produit`.`id_produit` IN ('1')
---
    public function modifierproduit($id)
    {
        $produitModel = new ProduitModel();
        $produit = $produitModel->find($id);

        if ($this->request->getMethod() === 'post') {
            $validation = \Config\Services::validation();

            $validation->setRules([
                'nom' => 'required',
                'prix' => 'required|numeric'
            ]);

            if ($validation->withRequest($this->request)->run()) {
                $updatedData = [
                    'nom_produit' => $this->request->getPost('nom'),
                    'prix' => $this->request->getPost('prix'),
                ];

                $produitModel->update($id, $updatedData);