app/Models/ArtisteModel.php

    public function getArtistes()
    {
        return $this->findAll();
---
SELECT *
FROM `artiste`