app/Models/FilmModel.php

    public function getFilms()
    {
        return $this->findAll();
---
SELECT *
FROM `film`